humapp/app/controllers/users/omniauth_callbacks_controller.rb

UPDATE "users" SET "updated_at" = ?, "doorkeeper_access_token" = ? WHERE "users"."id" = ?  [["updated_at", "2020-11-15 10:38:16.525513"], ["doorkeeper_access_token", "edL0tmb4Huld8MgLSVNIBAFY9iLc3FrO5yQEqCloyZ0"], ["id", 1]]
---
  def doorkeeper
    # puts "Hello"
    # puts request.env["omniauth.auth"]
    @user = User.from_omniauth(request.env["omniauth.auth"])

    if @user.persisted?
      @user.update_doorkeeper_credentials(request.env["omniauth.auth"])