iop-base-for-leaf/app/controllers/api/v1/base_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_resource_owner
    User.find(doorkeeper_token.resource_owner_id) if doorkeeper_token