iop-base-for-leaf/app/controllers/api/v1/leafs_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."name" = $1 LIMIT $2  [["name", "LeaF"], ["LIMIT", 1]]
SELECT "leaf_failures".* FROM "leaf_failures"
---
  def all
    @group = Group.find_by(name: "LeaF")
    if current_resource_owner.has_role? :admin, @group
      render json: {data: LeafFailure.all}

SELECT  "leaf_failure_types".* FROM "leaf_failure_types" WHERE "leaf_failure_types"."activity" = $1 AND "leaf_failure_types"."failure" = $2 AND "leaf_failure_types"."cause" = $3 ORDER BY "leaf_failure_types"."id" DESC LIMIT $4  [["activity", "Ausschneiden"], ["failure", "Nicht sauber geschnitten"], ["cause", "Maschinenfehler (Hilfspappe verschlissen)"], ["LIMIT", 1]]
---
  def add_record
    allowed_roles = ['werker', 'vorarbeiter', 'admin']
    assigned_roles = current_resource_owner.roles.where(resource_type: "Group", resource_id: @current_group.id).pluck(:name)
    if (allowed_roles & assigned_roles).empty?
      render json: {
                message: "Your role/s do not have sufficient permissions to add new record!",
              }, status: 401
    else
      uid = current_resource_owner.id
      e_datetime = DateTime.strptime(params[:error_datetime], '%Y-%m-%dT%H:%M:%S')
      failure_type = LeafFailureType.where(params.permit(:activity, :failure, :cause)).last