iop-base-for-leaf/app/controllers/api/v1/users_controller.rb

  def show
    data =  eval(current_resource_owner.to_json)
    role_data = {}
    current_resource_owner.groups.each do |g|
      role_data[g.name] = current_resource_owner.roles.where(resource_id: g.id).pluck(:name)
---
SELECT "groups".* FROM "groups" INNER JOIN "group_members" ON "groups"."id" = "group_members"."group_id" WHERE "group_members"."user_id" = $1  [["user_id", 1]]
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 AND "roles"."resource_id" = $2  [["user_id", 1], ["resource_id", 1]]

  def current_resource_owner
    User.find(doorkeeper_token.resource_owner_id) if doorkeeper_token
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]