iop-base-for-leaf/app/controllers/api/v1/humidity/active_sensors_controller.rb

  def index
    render json: {data: ActiveSensor.order(:id).all}
---
SELECT "active_sensors".* FROM "active_sensors" ORDER BY "active_sensors"."id" ASC