iop-base-for-leaf/app/controllers/api/v1/humidity/contracts_controller.rb

  def index
    data = Contract.all
---
SELECT "contracts".* FROM "contracts"