iop-base-for-leaf/app/views/groups/show.html.erb

<script type="text/javascript">
  $( ".role_button" ).click(function() {
    var uid = $(this).attr("data-id")
    var gid = $(this).attr("data-group-id")
    $.getJSON("/groups/memberrole?user_id="+uid+"&group_id="+gid, function(data){
      var table_data = ""
      $.each(data.roles, function(index, value){
        table_data = table_data
                      + '<tr><td class="text-center">'+ (index + 1 )+'</td>'
                      + '<td class="text-center">'+value+'</td>'
                      + '<td class="text-center"><a data-confirm="Are you sure?" class="btn btn-danger btn-sm py-0" rel="nofollow" data-method="delete" href="/groups/deletememberrole/'+uid+'?user_id='+uid+'&group_id='+gid+'&role='+value+'">Remove</a></td></tr>';
      });
      $("#hiddenGroupID").val(gid)
      $("#hiddenUserID").val(uid)
      $("#exixtingRolesTable > tbody").html(table_data)
      jQuery('#MemberRoleModal').modal('show');
      // $("#MemberRoleModalTitle").val('Roles for '+data.user_name)
    })
  });
---
SELECT "users".* FROM "users" INNER JOIN "group_members" ON "users"."id" = "group_members"."user_id" WHERE "group_members"."group_id" = $1  [["group_id", 1]]