iop-base-for-leaf/app/controllers/groups_controller.rb

  def showall
    @gps = Group.all
---
SELECT "groups".* FROM "groups"

  def show
    # params[:id]
    @group_id = params[:group_id]
    @group = Group.find_by(id: @group_id)
    @members = @group.users
    @table_names = @group.tables
    @group_roles = @group.group_roles
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "group_roles"."name" FROM "group_roles" WHERE "group_roles"."group_id" = $1  [["group_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def add_group
    user = User.find_by(email: params[:email])
    if user.nil?
      flash[:danger] = "User with email " + params[:email] + " does not exist!"
    elsif Group.exists?(name: "AWK20")
      flash[:danger] = "The given group name ('#{params[:name]}') already exits! Please try another name!"
    else
      group = Group.create(name: params[:name], owner_id: user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sourabh.mane@example.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "groups" WHERE "groups"."name" = $1 LIMIT $2  [["name", "AWK20"], ["LIMIT", 1]]
INSERT INTO "groups" ("name", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "LeaF"], ["owner_id", 1], ["created_at", "2020-11-12 17:32:34.063069"], ["updated_at", "2020-11-12 17:32:34.063069"]]

  def add_member
    # puts params
    user = User.find_by(email: params[:email])
    if user.nil?
      flash[:danger] = "User with email " + params[:email] + " does not exist!"
    else                #TODO implement logic in elsif to check if the given user is already in the group.
      group = Group.find_by(id: params[:group_id])
      GroupMember.create(user: user, group: group)
---
INSERT INTO "group_members" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["group_id", 1], ["created_at", "2020-11-12 17:32:34.100068"], ["updated_at", "2020-11-12 17:32:34.100068"]]

  def add_dataset
    gid = params[:group_id]
    role = params[:role]
    dsn = params[:dataset_name]
    group = Group.find_by(id: gid)
    # existing_datasets = group.tables.pluck(:dataset_name)
    # if existing_datasets.include?(params[:dataset_name])
    if DataOwner.where(group_id: group.id, role: role, dataset_name: dsn).exists?
      flash[:warning] = "Dataset you are trying to add is already added"
    else
      group.tables.create(dataset_name: params[:dataset_name], role: params[:role])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "groups" WHERE "groups"."owner_id" = $1 AND "groups"."id" = $2 LIMIT $3  [["owner_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "data_owners" WHERE "data_owners"."group_id" = $1 AND "data_owners"."role" = $2 AND "data_owners"."dataset_name" = $3 LIMIT $4  [["group_id", 1], ["role", "admin"], ["dataset_name", "LeafFailure"], ["LIMIT", 1]]
INSERT INTO "data_owners" ("group_id", "dataset_name", "created_at", "updated_at", "role") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["group_id", 1], ["dataset_name", "LeafFailure"], ["created_at", "2020-11-12 17:33:47.052085"], ["updated_at", "2020-11-12 17:33:47.052085"], ["role", "admin"]]

  def add_group_role
    group = Group.find_by(id: params[:group_id])
    group.group_roles.create(name: params[:role_name].downcase)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "group_roles" ("group_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 1], ["name", "admin"], ["created_at", "2020-11-12 17:32:44.790349"], ["updated_at", "2020-11-12 17:32:44.790349"]]

  def group_member_roles
    user = User.find(params[:user_id])
    roles = user.roles.where(resource_id: params[:group_id]).pluck(:name)
    render json: {roles: roles, user_name: user.firstname}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 AND "roles"."resource_id" = $2  [["user_id", 1], ["resource_id", 1]]
SELECT "roles"."id" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 1]]

  def add_group_member_role
    user = User.find(params[:user_id])
    group = Group.find(params[:group_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]