iop-base-for-leaf/app/controllers/leafs_controller.rb

  def index
    @data = LeafFailure.all
    @col = LeafFailure.column_names
    @count = LeafFailure.count()
---
SELECT "leaf_failures".* FROM "leaf_failures"
SELECT COUNT(*) FROM "leaf_failures"

  def authorize_access
    t = false
    current_user.groups.each do |g|
      roles = current_user.roles.where(resource_type: "Group", resource_id: g.id).pluck(:name)
---
SELECT "groups".* FROM "groups" INNER JOIN "group_members" ON "groups"."id" = "group_members"."group_id" WHERE "group_members"."user_id" = $1  [["user_id", 1]]
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 AND "roles"."resource_type" = $2 AND "roles"."resource_id" = $3  [["user_id", 1], ["resource_type", "Group"], ["resource_id", 1]]